In [1]:
import pandas as pd

In [4]:
df_main = pd.read_csv("python-ml-course-master/datasets/athletes/Medals.csv", encoding="ISO-8859-1")

In [5]:
df_main.head()

,Athlete,Age,Year,Closing Ceremony Date,Gold Medals,Silver Medals,Bronze Medals,Total Medals
0,Michael Phelps,23.0,2008,08/24/2008,8,0,0,8
1,Michael Phelps,19.0,2004,08/29/2004,6,0,2,8
2,Michael Phelps,27.0,2012,08/12/2012,4,2,0,6
3,Natalie Coughlin,25.0,2008,08/24/2008,1,2,3,6
4,Aleksey Nemov,24.0,2000,10/01/2000,2,1,3,6

In [8]:
q_atletas = df_main["Athlete"].unique().tolist()
len(q_atletas)

6956

In [10]:
df_country = pd.read_csv("python-ml-course-master/datasets/athletes/Athelete_Country_Map.csv", encoding="ISO-8859-1")

In [11]:
df_country.head()

            Athlete        Country
0    Michael Phelps  United States
1  Natalie Coughlin  United States
2     Aleksey Nemov         Russia
3     Alicia Coutts      Australia
4    Missy Franklin  United States

In [12]:
len(df_country)

6970

In [13]:
df_country[df_country["Athlete"] == "Aleksandar Ciric"]

               Athlete                Country
1029  Aleksandar Ciric                 Serbia
1086  Aleksandar Ciric  Serbia and Montenegro

In [14]:
df_sport = pd.read_csv("python-ml-course-master/datasets/athletes/Athelete_Sports_Map.csv", encoding="ISO-8859-1")

In [15]:
df_sport.head()

            Athlete       Sport
0    Michael Phelps    Swimming
1  Natalie Coughlin    Swimming
2     Aleksey Nemov  Gymnastics
3     Alicia Coutts    Swimming
4    Missy Franklin    Swimming

In [16]:
len(df_sport)

6975

In [19]:
df_sport[(df_sport["Athlete"] == "Chen Jing") | (df_sport["Athlete"] == "Richard Thompson") | (df_sport["Athlete"] == "Matt Ryan")]

               Athlete         Sport
528   Richard Thompson     Athletics
1308         Chen Jing    Volleyball
1419         Chen Jing  Table Tennis
2727         Matt Ryan        Rowing
5003         Matt Ryan    Equestrian
5691  Richard Thompson      Baseball